CSI API ETABS v1
cPropFrameSDShape.GetReinfCircle Method
 Retrieves property data for a circular reinforcing shape in a section designer section
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetReinfCircle(
	string Name,
	string ShapeName,
	ref double XCenter,
	ref double YCenter,
	ref double Diameter,
	ref int NumBars,
	ref double Rotation,
	ref string RebarSize,
	ref string MatRebar
)
Function GetReinfCircle (
	Name As String,
	ShapeName As String,
	ByRef XCenter As Double,
	ByRef YCenter As Double,
	ByRef Diameter As Double,
	ByRef NumBars As Integer,
	ByRef Rotation As Double,
	ByRef RebarSize As String,
	ByRef MatRebar As String
) As Integer
Dim instance As cPropFrameSDShape
Dim Name As String
Dim ShapeName As String
Dim XCenter As Double
Dim YCenter As Double
Dim Diameter As Double
Dim NumBars As Integer
Dim Rotation As Double
Dim RebarSize As String
Dim MatRebar As String
Dim returnValue As Integer
returnValue = instance.GetReinfCircle(Name,
	ShapeName, XCenter, YCenter, Diameter,
	NumBars, Rotation, RebarSize, MatRebar)
int GetReinfCircle(
	String^ Name,
	String^ ShapeName,
	double% XCenter,
	double% YCenter,
	double% Diameter,
	int% NumBars,
	double% Rotation,
	String^% RebarSize,
	String^% MatRebar
)
abstract GetReinfCircle :
        Name : string *
        ShapeName : string *
        XCenter : float byref *
        YCenter : float byref *
        Diameter : float byref *
        NumBars : int byref *
        Rotation : float byref *
        RebarSize : string byref *
        MatRebar : string byref -> int
Parameters
Name
Type: System.String
 The name of an existing frame section property that is a section designer section
ShapeName
Type: System.String
 The name of a circular reinforcing shape in the section designer section
XCenter
Type: System.Double
 The X-coordinate of the center of the shape in the section designer coordinate system. [L]
YCenter
Type: System.Double
 The Y-coordinate of the center of the shape in the section designer coordinate system. [L]
Diameter
Type: System.Double
 The diameter of the circular shape. [L]
NumBars
Type: System.Int32
 The number of equally spaced bars for the circular reinforcing
Rotation
Type: System.Double
 The counter clockwise rotation of the shape from its default orientation. [deg]
RebarSize
Type: System.String
 The size of the reinforcing bar
MatRebar
Type: System.String
 The material property for the reinforcing steel
Return Value
Type: Int32
 Returns zero if the property data is successfully retrieved; otherwise it returns a nonzero value
Remarks
See Also
Reference
cPropFrameSDShape Interface
ETABSv1 Namespace